Revit 2027 API
MassLevelData.NLevelPerimeter Property
 The perimeter of the intersection of the MassLevelData's level with the mass geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NLevelPerimeter { get; }
Public ReadOnly Property NLevelPerimeter As Double
	Get
public:
property double NLevelPerimeter {
	double get ();
}
member NLevelPerimeter : float with get
Property Value
Double
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace